MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/mcan.h
/*
 * Component description for MCAN
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-04-15T17:35:10Z  */
#ifndef _PIC32CZMC70_MCAN_COMPONENT_H_
#define _PIC32CZMC70_MCAN_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR MCAN                      */
/* ************************************************************************** */

/* -------- MCAN_RXBE_0 : (MCAN Offset: 0x00) (R/W 32) Rx Buffer Element 0 -------- */
#define MCAN_RXBE_0_ID_Pos                    _UINT32_(0)                                          /* (MCAN_RXBE_0) Identifier Position */
#define MCAN_RXBE_0_ID_Msk                    (_UINT32_(0x1FFFFFFF) << MCAN_RXBE_0_ID_Pos)         /* (MCAN_RXBE_0) Identifier Mask */
#define MCAN_RXBE_0_ID(value)                 (MCAN_RXBE_0_ID_Msk & (_UINT32_(value) << MCAN_RXBE_0_ID_Pos)) /* Assignment of value for ID in the MCAN_RXBE_0 register */
#define MCAN_RXBE_0_RTR_Pos                   _UINT32_(29)                                         /* (MCAN_RXBE_0) Remote Transmission Request Position */
#define MCAN_RXBE_0_RTR_Msk                   (_UINT32_(0x1) << MCAN_RXBE_0_RTR_Pos)               /* (MCAN_RXBE_0) Remote Transmission Request Mask */
#define MCAN_RXBE_0_RTR(value)                (MCAN_RXBE_0_RTR_Msk & (_UINT32_(value) << MCAN_RXBE_0_RTR_Pos)) /* Assignment of value for RTR in the MCAN_RXBE_0 register */
#define MCAN_RXBE_0_XTD_Pos                   _UINT32_(30)                                         /* (MCAN_RXBE_0) Extended Identifier Position */
#define MCAN_RXBE_0_XTD_Msk                   (_UINT32_(0x1) << MCAN_RXBE_0_XTD_Pos)               /* (MCAN_RXBE_0) Extended Identifier Mask */
#define MCAN_RXBE_0_XTD(value)                (MCAN_RXBE_0_XTD_Msk & (_UINT32_(value) << MCAN_RXBE_0_XTD_Pos)) /* Assignment of value for XTD in the MCAN_RXBE_0 register */
#define MCAN_RXBE_0_ESI_Pos                   _UINT32_(31)                                         /* (MCAN_RXBE_0) Error State Indicator Position */
#define MCAN_RXBE_0_ESI_Msk                   (_UINT32_(0x1) << MCAN_RXBE_0_ESI_Pos)               /* (MCAN_RXBE_0) Error State Indicator Mask */
#define MCAN_RXBE_0_ESI(value)                (MCAN_RXBE_0_ESI_Msk & (_UINT32_(value) << MCAN_RXBE_0_ESI_Pos)) /* Assignment of value for ESI in the MCAN_RXBE_0 register */
#define MCAN_RXBE_0_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (MCAN_RXBE_0) Register Mask  */


/* -------- MCAN_RXBE_1 : (MCAN Offset: 0x04) (R/W 32) Rx Buffer Element 1 -------- */
#define MCAN_RXBE_1_RXTS_Pos                  _UINT32_(0)                                          /* (MCAN_RXBE_1) Rx Timestamp Position */
#define MCAN_RXBE_1_RXTS_Msk                  (_UINT32_(0xFFFF) << MCAN_RXBE_1_RXTS_Pos)           /* (MCAN_RXBE_1) Rx Timestamp Mask */
#define MCAN_RXBE_1_RXTS(value)               (MCAN_RXBE_1_RXTS_Msk & (_UINT32_(value) << MCAN_RXBE_1_RXTS_Pos)) /* Assignment of value for RXTS in the MCAN_RXBE_1 register */
#define MCAN_RXBE_1_DLC_Pos                   _UINT32_(16)                                         /* (MCAN_RXBE_1) Data Length Code Position */
#define MCAN_RXBE_1_DLC_Msk                   (_UINT32_(0xF) << MCAN_RXBE_1_DLC_Pos)               /* (MCAN_RXBE_1) Data Length Code Mask */
#define MCAN_RXBE_1_DLC(value)                (MCAN_RXBE_1_DLC_Msk & (_UINT32_(value) << MCAN_RXBE_1_DLC_Pos)) /* Assignment of value for DLC in the MCAN_RXBE_1 register */
#define MCAN_RXBE_1_BRS_Pos                   _UINT32_(20)                                         /* (MCAN_RXBE_1) Bit Rate Switch Position */
#define MCAN_RXBE_1_BRS_Msk                   (_UINT32_(0x1) << MCAN_RXBE_1_BRS_Pos)               /* (MCAN_RXBE_1) Bit Rate Switch Mask */
#define MCAN_RXBE_1_BRS(value)                (MCAN_RXBE_1_BRS_Msk & (_UINT32_(value) << MCAN_RXBE_1_BRS_Pos)) /* Assignment of value for BRS in the MCAN_RXBE_1 register */
#define MCAN_RXBE_1_FDF_Pos                   _UINT32_(21)                                         /* (MCAN_RXBE_1) FD Format Position */
#define MCAN_RXBE_1_FDF_Msk                   (_UINT32_(0x1) << MCAN_RXBE_1_FDF_Pos)               /* (MCAN_RXBE_1) FD Format Mask */
#define MCAN_RXBE_1_FDF(value)                (MCAN_RXBE_1_FDF_Msk & (_UINT32_(value) << MCAN_RXBE_1_FDF_Pos)) /* Assignment of value for FDF in the MCAN_RXBE_1 register */
#define MCAN_RXBE_1_FIDX_Pos                  _UINT32_(24)                                         /* (MCAN_RXBE_1) Filter Index Position */
#define MCAN_RXBE_1_FIDX_Msk                  (_UINT32_(0x7F) << MCAN_RXBE_1_FIDX_Pos)             /* (MCAN_RXBE_1) Filter Index Mask */
#define MCAN_RXBE_1_FIDX(value)               (MCAN_RXBE_1_FIDX_Msk & (_UINT32_(value) << MCAN_RXBE_1_FIDX_Pos)) /* Assignment of value for FIDX in the MCAN_RXBE_1 register */
#define MCAN_RXBE_1_ANMF_Pos                  _UINT32_(31)                                         /* (MCAN_RXBE_1) Accepted Non-matching Frame Position */
#define MCAN_RXBE_1_ANMF_Msk                  (_UINT32_(0x1) << MCAN_RXBE_1_ANMF_Pos)              /* (MCAN_RXBE_1) Accepted Non-matching Frame Mask */
#define MCAN_RXBE_1_ANMF(value)               (MCAN_RXBE_1_ANMF_Msk & (_UINT32_(value) << MCAN_RXBE_1_ANMF_Pos)) /* Assignment of value for ANMF in the MCAN_RXBE_1 register */
#define MCAN_RXBE_1_Msk                       _UINT32_(0xFF3FFFFF)                                 /* (MCAN_RXBE_1) Register Mask  */


/* -------- MCAN_RXBE_DATA : (MCAN Offset: 0x08) (R/W 32) Rx Buffer Element Data -------- */
#define MCAN_RXBE_DATA_DB0_Pos                _UINT32_(0)                                          /* (MCAN_RXBE_DATA) Data Byte 0 Position */
#define MCAN_RXBE_DATA_DB0_Msk                (_UINT32_(0xFF) << MCAN_RXBE_DATA_DB0_Pos)           /* (MCAN_RXBE_DATA) Data Byte 0 Mask */
#define MCAN_RXBE_DATA_DB0(value)             (MCAN_RXBE_DATA_DB0_Msk & (_UINT32_(value) << MCAN_RXBE_DATA_DB0_Pos)) /* Assignment of value for DB0 in the MCAN_RXBE_DATA register */
#define MCAN_RXBE_DATA_DB1_Pos                _UINT32_(8)                                          /* (MCAN_RXBE_DATA) Data Byte 1 Position */
#define MCAN_RXBE_DATA_DB1_Msk                (_UINT32_(0xFF) << MCAN_RXBE_DATA_DB1_Pos)           /* (MCAN_RXBE_DATA) Data Byte 1 Mask */
#define MCAN_RXBE_DATA_DB1(value)             (MCAN_RXBE_DATA_DB1_Msk & (_UINT32_(value) << MCAN_RXBE_DATA_DB1_Pos)) /* Assignment of value for DB1 in the MCAN_RXBE_DATA register */
#define MCAN_RXBE_DATA_DB2_Pos                _UINT32_(16)                                         /* (MCAN_RXBE_DATA) Data Byte 2 Position */
#define MCAN_RXBE_DATA_DB2_Msk                (_UINT32_(0xFF) << MCAN_RXBE_DATA_DB2_Pos)           /* (MCAN_RXBE_DATA) Data Byte 2 Mask */
#define MCAN_RXBE_DATA_DB2(value)             (MCAN_RXBE_DATA_DB2_Msk & (_UINT32_(value) << MCAN_RXBE_DATA_DB2_Pos)) /* Assignment of value for DB2 in the MCAN_RXBE_DATA register */
#define MCAN_RXBE_DATA_DB3_Pos                _UINT32_(24)                                         /* (MCAN_RXBE_DATA) Data Byte 3 Position */
#define MCAN_RXBE_DATA_DB3_Msk                (_UINT32_(0xFF) << MCAN_RXBE_DATA_DB3_Pos)           /* (MCAN_RXBE_DATA) Data Byte 3 Mask */
#define MCAN_RXBE_DATA_DB3(value)             (MCAN_RXBE_DATA_DB3_Msk & (_UINT32_(value) << MCAN_RXBE_DATA_DB3_Pos)) /* Assignment of value for DB3 in the MCAN_RXBE_DATA register */
#define MCAN_RXBE_DATA_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (MCAN_RXBE_DATA) Register Mask  */


