MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/mcan.h
/* -------- MCAN_RXF0E_0 : (MCAN Offset: 0x00) (R/W 32) Rx FIFO 0 Element 0 -------- */
#define MCAN_RXF0E_0_ID_Pos                   _UINT32_(0)                                          /* (MCAN_RXF0E_0) Identifier Position */
#define MCAN_RXF0E_0_ID_Msk                   (_UINT32_(0x1FFFFFFF) << MCAN_RXF0E_0_ID_Pos)        /* (MCAN_RXF0E_0) Identifier Mask */
#define MCAN_RXF0E_0_ID(value)                (MCAN_RXF0E_0_ID_Msk & (_UINT32_(value) << MCAN_RXF0E_0_ID_Pos)) /* Assignment of value for ID in the MCAN_RXF0E_0 register */
#define MCAN_RXF0E_0_RTR_Pos                  _UINT32_(29)                                         /* (MCAN_RXF0E_0) Remote Transmission Request Position */
#define MCAN_RXF0E_0_RTR_Msk                  (_UINT32_(0x1) << MCAN_RXF0E_0_RTR_Pos)              /* (MCAN_RXF0E_0) Remote Transmission Request Mask */
#define MCAN_RXF0E_0_RTR(value)               (MCAN_RXF0E_0_RTR_Msk & (_UINT32_(value) << MCAN_RXF0E_0_RTR_Pos)) /* Assignment of value for RTR in the MCAN_RXF0E_0 register */
#define MCAN_RXF0E_0_XTD_Pos                  _UINT32_(30)                                         /* (MCAN_RXF0E_0) Extended Identifier Position */
#define MCAN_RXF0E_0_XTD_Msk                  (_UINT32_(0x1) << MCAN_RXF0E_0_XTD_Pos)              /* (MCAN_RXF0E_0) Extended Identifier Mask */
#define MCAN_RXF0E_0_XTD(value)               (MCAN_RXF0E_0_XTD_Msk & (_UINT32_(value) << MCAN_RXF0E_0_XTD_Pos)) /* Assignment of value for XTD in the MCAN_RXF0E_0 register */
#define MCAN_RXF0E_0_ESI_Pos                  _UINT32_(31)                                         /* (MCAN_RXF0E_0) Error State Indicator Position */
#define MCAN_RXF0E_0_ESI_Msk                  (_UINT32_(0x1) << MCAN_RXF0E_0_ESI_Pos)              /* (MCAN_RXF0E_0) Error State Indicator Mask */
#define MCAN_RXF0E_0_ESI(value)               (MCAN_RXF0E_0_ESI_Msk & (_UINT32_(value) << MCAN_RXF0E_0_ESI_Pos)) /* Assignment of value for ESI in the MCAN_RXF0E_0 register */
#define MCAN_RXF0E_0_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (MCAN_RXF0E_0) Register Mask  */


/* -------- MCAN_RXF0E_1 : (MCAN Offset: 0x04) (R/W 32) Rx FIFO 0 Element 1 -------- */
#define MCAN_RXF0E_1_RXTS_Pos                 _UINT32_(0)                                          /* (MCAN_RXF0E_1) Rx Timestamp Position */
#define MCAN_RXF0E_1_RXTS_Msk                 (_UINT32_(0xFFFF) << MCAN_RXF0E_1_RXTS_Pos)          /* (MCAN_RXF0E_1) Rx Timestamp Mask */
#define MCAN_RXF0E_1_RXTS(value)              (MCAN_RXF0E_1_RXTS_Msk & (_UINT32_(value) << MCAN_RXF0E_1_RXTS_Pos)) /* Assignment of value for RXTS in the MCAN_RXF0E_1 register */
#define MCAN_RXF0E_1_DLC_Pos                  _UINT32_(16)                                         /* (MCAN_RXF0E_1) Data Length Code Position */
#define MCAN_RXF0E_1_DLC_Msk                  (_UINT32_(0xF) << MCAN_RXF0E_1_DLC_Pos)              /* (MCAN_RXF0E_1) Data Length Code Mask */
#define MCAN_RXF0E_1_DLC(value)               (MCAN_RXF0E_1_DLC_Msk & (_UINT32_(value) << MCAN_RXF0E_1_DLC_Pos)) /* Assignment of value for DLC in the MCAN_RXF0E_1 register */
#define MCAN_RXF0E_1_BRS_Pos                  _UINT32_(20)                                         /* (MCAN_RXF0E_1) Bit Rate Switch Position */
#define MCAN_RXF0E_1_BRS_Msk                  (_UINT32_(0x1) << MCAN_RXF0E_1_BRS_Pos)              /* (MCAN_RXF0E_1) Bit Rate Switch Mask */
#define MCAN_RXF0E_1_BRS(value)               (MCAN_RXF0E_1_BRS_Msk & (_UINT32_(value) << MCAN_RXF0E_1_BRS_Pos)) /* Assignment of value for BRS in the MCAN_RXF0E_1 register */
#define MCAN_RXF0E_1_FDF_Pos                  _UINT32_(21)                                         /* (MCAN_RXF0E_1) FD Format Position */
#define MCAN_RXF0E_1_FDF_Msk                  (_UINT32_(0x1) << MCAN_RXF0E_1_FDF_Pos)              /* (MCAN_RXF0E_1) FD Format Mask */
#define MCAN_RXF0E_1_FDF(value)               (MCAN_RXF0E_1_FDF_Msk & (_UINT32_(value) << MCAN_RXF0E_1_FDF_Pos)) /* Assignment of value for FDF in the MCAN_RXF0E_1 register */
#define MCAN_RXF0E_1_FIDX_Pos                 _UINT32_(24)                                         /* (MCAN_RXF0E_1) Filter Index Position */
#define MCAN_RXF0E_1_FIDX_Msk                 (_UINT32_(0x7F) << MCAN_RXF0E_1_FIDX_Pos)            /* (MCAN_RXF0E_1) Filter Index Mask */
#define MCAN_RXF0E_1_FIDX(value)              (MCAN_RXF0E_1_FIDX_Msk & (_UINT32_(value) << MCAN_RXF0E_1_FIDX_Pos)) /* Assignment of value for FIDX in the MCAN_RXF0E_1 register */
#define MCAN_RXF0E_1_ANMF_Pos                 _UINT32_(31)                                         /* (MCAN_RXF0E_1) Accepted Non-matching Frame Position */
#define MCAN_RXF0E_1_ANMF_Msk                 (_UINT32_(0x1) << MCAN_RXF0E_1_ANMF_Pos)             /* (MCAN_RXF0E_1) Accepted Non-matching Frame Mask */
#define MCAN_RXF0E_1_ANMF(value)              (MCAN_RXF0E_1_ANMF_Msk & (_UINT32_(value) << MCAN_RXF0E_1_ANMF_Pos)) /* Assignment of value for ANMF in the MCAN_RXF0E_1 register */
#define MCAN_RXF0E_1_Msk                      _UINT32_(0xFF3FFFFF)                                 /* (MCAN_RXF0E_1) Register Mask  */


/* -------- MCAN_RXF0E_DATA : (MCAN Offset: 0x08) (R/W 32) Rx FIFO 0 Element Data -------- */
#define MCAN_RXF0E_DATA_DB0_Pos               _UINT32_(0)                                          /* (MCAN_RXF0E_DATA) Data Byte 0 Position */
#define MCAN_RXF0E_DATA_DB0_Msk               (_UINT32_(0xFF) << MCAN_RXF0E_DATA_DB0_Pos)          /* (MCAN_RXF0E_DATA) Data Byte 0 Mask */
#define MCAN_RXF0E_DATA_DB0(value)            (MCAN_RXF0E_DATA_DB0_Msk & (_UINT32_(value) << MCAN_RXF0E_DATA_DB0_Pos)) /* Assignment of value for DB0 in the MCAN_RXF0E_DATA register */
#define MCAN_RXF0E_DATA_DB1_Pos               _UINT32_(8)                                          /* (MCAN_RXF0E_DATA) Data Byte 1 Position */
#define MCAN_RXF0E_DATA_DB1_Msk               (_UINT32_(0xFF) << MCAN_RXF0E_DATA_DB1_Pos)          /* (MCAN_RXF0E_DATA) Data Byte 1 Mask */
#define MCAN_RXF0E_DATA_DB1(value)            (MCAN_RXF0E_DATA_DB1_Msk & (_UINT32_(value) << MCAN_RXF0E_DATA_DB1_Pos)) /* Assignment of value for DB1 in the MCAN_RXF0E_DATA register */
#define MCAN_RXF0E_DATA_DB2_Pos               _UINT32_(16)                                         /* (MCAN_RXF0E_DATA) Data Byte 2 Position */
#define MCAN_RXF0E_DATA_DB2_Msk               (_UINT32_(0xFF) << MCAN_RXF0E_DATA_DB2_Pos)          /* (MCAN_RXF0E_DATA) Data Byte 2 Mask */
#define MCAN_RXF0E_DATA_DB2(value)            (MCAN_RXF0E_DATA_DB2_Msk & (_UINT32_(value) << MCAN_RXF0E_DATA_DB2_Pos)) /* Assignment of value for DB2 in the MCAN_RXF0E_DATA register */
#define MCAN_RXF0E_DATA_DB3_Pos               _UINT32_(24)                                         /* (MCAN_RXF0E_DATA) Data Byte 3 Position */
#define MCAN_RXF0E_DATA_DB3_Msk               (_UINT32_(0xFF) << MCAN_RXF0E_DATA_DB3_Pos)          /* (MCAN_RXF0E_DATA) Data Byte 3 Mask */
#define MCAN_RXF0E_DATA_DB3(value)            (MCAN_RXF0E_DATA_DB3_Msk & (_UINT32_(value) << MCAN_RXF0E_DATA_DB3_Pos)) /* Assignment of value for DB3 in the MCAN_RXF0E_DATA register */
#define MCAN_RXF0E_DATA_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (MCAN_RXF0E_DATA) Register Mask  */


