MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/mcan.h
/* -------- MCAN_TDCR : (MCAN Offset: 0x48) (R/W 32) Transmit Delay Compensation Register -------- */
#define MCAN_TDCR_TDCF_Pos                    _UINT32_(0)                                          /* (MCAN_TDCR) Transmitter Delay Compensation Filter Position */
#define MCAN_TDCR_TDCF_Msk                    (_UINT32_(0x7F) << MCAN_TDCR_TDCF_Pos)               /* (MCAN_TDCR) Transmitter Delay Compensation Filter Mask */
#define MCAN_TDCR_TDCF(value)                 (MCAN_TDCR_TDCF_Msk & (_UINT32_(value) << MCAN_TDCR_TDCF_Pos)) /* Assignment of value for TDCF in the MCAN_TDCR register */
#define MCAN_TDCR_TDCO_Pos                    _UINT32_(8)                                          /* (MCAN_TDCR) Transmitter Delay Compensation Offset Position */
#define MCAN_TDCR_TDCO_Msk                    (_UINT32_(0x7F) << MCAN_TDCR_TDCO_Pos)               /* (MCAN_TDCR) Transmitter Delay Compensation Offset Mask */
#define MCAN_TDCR_TDCO(value)                 (MCAN_TDCR_TDCO_Msk & (_UINT32_(value) << MCAN_TDCR_TDCO_Pos)) /* Assignment of value for TDCO in the MCAN_TDCR register */
#define MCAN_TDCR_Msk                         _UINT32_(0x00007F7F)                                 /* (MCAN_TDCR) Register Mask  */


/* -------- MCAN_IR : (MCAN Offset: 0x50) (R/W 32) Interrupt Register -------- */
#define MCAN_IR_RF0N_Pos                      _UINT32_(0)                                          /* (MCAN_IR) Receive FIFO 0 New Message Position */
#define MCAN_IR_RF0N_Msk                      (_UINT32_(0x1) << MCAN_IR_RF0N_Pos)                  /* (MCAN_IR) Receive FIFO 0 New Message Mask */
#define MCAN_IR_RF0N(value)                   (MCAN_IR_RF0N_Msk & (_UINT32_(value) << MCAN_IR_RF0N_Pos)) /* Assignment of value for RF0N in the MCAN_IR register */
#define MCAN_IR_RF0W_Pos                      _UINT32_(1)                                          /* (MCAN_IR) Receive FIFO 0 Watermark Reached Position */
#define MCAN_IR_RF0W_Msk                      (_UINT32_(0x1) << MCAN_IR_RF0W_Pos)                  /* (MCAN_IR) Receive FIFO 0 Watermark Reached Mask */
#define MCAN_IR_RF0W(value)                   (MCAN_IR_RF0W_Msk & (_UINT32_(value) << MCAN_IR_RF0W_Pos)) /* Assignment of value for RF0W in the MCAN_IR register */
#define MCAN_IR_RF0F_Pos                      _UINT32_(2)                                          /* (MCAN_IR) Receive FIFO 0 Full Position */
#define MCAN_IR_RF0F_Msk                      (_UINT32_(0x1) << MCAN_IR_RF0F_Pos)                  /* (MCAN_IR) Receive FIFO 0 Full Mask */
#define MCAN_IR_RF0F(value)                   (MCAN_IR_RF0F_Msk & (_UINT32_(value) << MCAN_IR_RF0F_Pos)) /* Assignment of value for RF0F in the MCAN_IR register */
#define MCAN_IR_RF0L_Pos                      _UINT32_(3)                                          /* (MCAN_IR) Receive FIFO 0 Message Lost Position */
#define MCAN_IR_RF0L_Msk                      (_UINT32_(0x1) << MCAN_IR_RF0L_Pos)                  /* (MCAN_IR) Receive FIFO 0 Message Lost Mask */
#define MCAN_IR_RF0L(value)                   (MCAN_IR_RF0L_Msk & (_UINT32_(value) << MCAN_IR_RF0L_Pos)) /* Assignment of value for RF0L in the MCAN_IR register */
#define MCAN_IR_RF1N_Pos                      _UINT32_(4)                                          /* (MCAN_IR) Receive FIFO 1 New Message Position */
#define MCAN_IR_RF1N_Msk                      (_UINT32_(0x1) << MCAN_IR_RF1N_Pos)                  /* (MCAN_IR) Receive FIFO 1 New Message Mask */
#define MCAN_IR_RF1N(value)                   (MCAN_IR_RF1N_Msk & (_UINT32_(value) << MCAN_IR_RF1N_Pos)) /* Assignment of value for RF1N in the MCAN_IR register */
#define MCAN_IR_RF1W_Pos                      _UINT32_(5)                                          /* (MCAN_IR) Receive FIFO 1 Watermark Reached Position */
#define MCAN_IR_RF1W_Msk                      (_UINT32_(0x1) << MCAN_IR_RF1W_Pos)                  /* (MCAN_IR) Receive FIFO 1 Watermark Reached Mask */
#define MCAN_IR_RF1W(value)                   (MCAN_IR_RF1W_Msk & (_UINT32_(value) << MCAN_IR_RF1W_Pos)) /* Assignment of value for RF1W in the MCAN_IR register */
#define MCAN_IR_RF1F_Pos                      _UINT32_(6)                                          /* (MCAN_IR) Receive FIFO 1 Full Position */
#define MCAN_IR_RF1F_Msk                      (_UINT32_(0x1) << MCAN_IR_RF1F_Pos)                  /* (MCAN_IR) Receive FIFO 1 Full Mask */
#define MCAN_IR_RF1F(value)                   (MCAN_IR_RF1F_Msk & (_UINT32_(value) << MCAN_IR_RF1F_Pos)) /* Assignment of value for RF1F in the MCAN_IR register */
#define MCAN_IR_RF1L_Pos                      _UINT32_(7)                                          /* (MCAN_IR) Receive FIFO 1 Message Lost Position */
#define MCAN_IR_RF1L_Msk                      (_UINT32_(0x1) << MCAN_IR_RF1L_Pos)                  /* (MCAN_IR) Receive FIFO 1 Message Lost Mask */
#define MCAN_IR_RF1L(value)                   (MCAN_IR_RF1L_Msk & (_UINT32_(value) << MCAN_IR_RF1L_Pos)) /* Assignment of value for RF1L in the MCAN_IR register */
#define MCAN_IR_HPM_Pos                       _UINT32_(8)                                          /* (MCAN_IR) High Priority Message Position */
#define MCAN_IR_HPM_Msk                       (_UINT32_(0x1) << MCAN_IR_HPM_Pos)                   /* (MCAN_IR) High Priority Message Mask */
#define MCAN_IR_HPM(value)                    (MCAN_IR_HPM_Msk & (_UINT32_(value) << MCAN_IR_HPM_Pos)) /* Assignment of value for HPM in the MCAN_IR register */
#define MCAN_IR_TC_Pos                        _UINT32_(9)                                          /* (MCAN_IR) Transmission Completed Position */
#define MCAN_IR_TC_Msk                        (_UINT32_(0x1) << MCAN_IR_TC_Pos)                    /* (MCAN_IR) Transmission Completed Mask */
#define MCAN_IR_TC(value)                     (MCAN_IR_TC_Msk & (_UINT32_(value) << MCAN_IR_TC_Pos)) /* Assignment of value for TC in the MCAN_IR register */
#define MCAN_IR_TCF_Pos                       _UINT32_(10)                                         /* (MCAN_IR) Transmission Cancellation Finished Position */
#define MCAN_IR_TCF_Msk                       (_UINT32_(0x1) << MCAN_IR_TCF_Pos)                   /* (MCAN_IR) Transmission Cancellation Finished Mask */
#define MCAN_IR_TCF(value)                    (MCAN_IR_TCF_Msk & (_UINT32_(value) << MCAN_IR_TCF_Pos)) /* Assignment of value for TCF in the MCAN_IR register */
#define MCAN_IR_TFE_Pos                       _UINT32_(11)                                         /* (MCAN_IR) Tx FIFO Empty Position */
#define MCAN_IR_TFE_Msk                       (_UINT32_(0x1) << MCAN_IR_TFE_Pos)                   /* (MCAN_IR) Tx FIFO Empty Mask */
#define MCAN_IR_TFE(value)                    (MCAN_IR_TFE_Msk & (_UINT32_(value) << MCAN_IR_TFE_Pos)) /* Assignment of value for TFE in the MCAN_IR register */
#define MCAN_IR_TEFN_Pos                      _UINT32_(12)                                         /* (MCAN_IR) Tx Event FIFO New Entry Position */
#define MCAN_IR_TEFN_Msk                      (_UINT32_(0x1) << MCAN_IR_TEFN_Pos)                  /* (MCAN_IR) Tx Event FIFO New Entry Mask */
#define MCAN_IR_TEFN(value)                   (MCAN_IR_TEFN_Msk & (_UINT32_(value) << MCAN_IR_TEFN_Pos)) /* Assignment of value for TEFN in the MCAN_IR register */
#define MCAN_IR_TEFW_Pos                      _UINT32_(13)                                         /* (MCAN_IR) Tx Event FIFO Watermark Reached Position */
#define MCAN_IR_TEFW_Msk                      (_UINT32_(0x1) << MCAN_IR_TEFW_Pos)                  /* (MCAN_IR) Tx Event FIFO Watermark Reached Mask */
#define MCAN_IR_TEFW(value)                   (MCAN_IR_TEFW_Msk & (_UINT32_(value) << MCAN_IR_TEFW_Pos)) /* Assignment of value for TEFW in the MCAN_IR register */
#define MCAN_IR_TEFF_Pos                      _UINT32_(14)                                         /* (MCAN_IR) Tx Event FIFO Full Position */
#define MCAN_IR_TEFF_Msk                      (_UINT32_(0x1) << MCAN_IR_TEFF_Pos)                  /* (MCAN_IR) Tx Event FIFO Full Mask */
#define MCAN_IR_TEFF(value)                   (MCAN_IR_TEFF_Msk & (_UINT32_(value) << MCAN_IR_TEFF_Pos)) /* Assignment of value for TEFF in the MCAN_IR register */
#define MCAN_IR_TEFL_Pos                      _UINT32_(15)                                         /* (MCAN_IR) Tx Event FIFO Element Lost Position */
#define MCAN_IR_TEFL_Msk                      (_UINT32_(0x1) << MCAN_IR_TEFL_Pos)                  /* (MCAN_IR) Tx Event FIFO Element Lost Mask */
#define MCAN_IR_TEFL(value)                   (MCAN_IR_TEFL_Msk & (_UINT32_(value) << MCAN_IR_TEFL_Pos)) /* Assignment of value for TEFL in the MCAN_IR register */
#define MCAN_IR_TSW_Pos                       _UINT32_(16)                                         /* (MCAN_IR) Timestamp Wraparound Position */
#define MCAN_IR_TSW_Msk                       (_UINT32_(0x1) << MCAN_IR_TSW_Pos)                   /* (MCAN_IR) Timestamp Wraparound Mask */
#define MCAN_IR_TSW(value)                    (MCAN_IR_TSW_Msk & (_UINT32_(value) << MCAN_IR_TSW_Pos)) /* Assignment of value for TSW in the MCAN_IR register */
#define MCAN_IR_MRAF_Pos                      _UINT32_(17)                                         /* (MCAN_IR) Message RAM Access Failure Position */
#define MCAN_IR_MRAF_Msk                      (_UINT32_(0x1) << MCAN_IR_MRAF_Pos)                  /* (MCAN_IR) Message RAM Access Failure Mask */
#define MCAN_IR_MRAF(value)                   (MCAN_IR_MRAF_Msk & (_UINT32_(value) << MCAN_IR_MRAF_Pos)) /* Assignment of value for MRAF in the MCAN_IR register */
#define MCAN_IR_TOO_Pos                       _UINT32_(18)                                         /* (MCAN_IR) Timeout Occurred Position */
#define MCAN_IR_TOO_Msk                       (_UINT32_(0x1) << MCAN_IR_TOO_Pos)                   /* (MCAN_IR) Timeout Occurred Mask */
#define MCAN_IR_TOO(value)                    (MCAN_IR_TOO_Msk & (_UINT32_(value) << MCAN_IR_TOO_Pos)) /* Assignment of value for TOO in the MCAN_IR register */
#define MCAN_IR_DRX_Pos                       _UINT32_(19)                                         /* (MCAN_IR) Message stored to Dedicated Receive Buffer Position */
#define MCAN_IR_DRX_Msk                       (_UINT32_(0x1) << MCAN_IR_DRX_Pos)                   /* (MCAN_IR) Message stored to Dedicated Receive Buffer Mask */
#define MCAN_IR_DRX(value)                    (MCAN_IR_DRX_Msk & (_UINT32_(value) << MCAN_IR_DRX_Pos)) /* Assignment of value for DRX in the MCAN_IR register */
#define MCAN_IR_ELO_Pos                       _UINT32_(22)                                         /* (MCAN_IR) Error Logging Overflow Position */
#define MCAN_IR_ELO_Msk                       (_UINT32_(0x1) << MCAN_IR_ELO_Pos)                   /* (MCAN_IR) Error Logging Overflow Mask */
#define MCAN_IR_ELO(value)                    (MCAN_IR_ELO_Msk & (_UINT32_(value) << MCAN_IR_ELO_Pos)) /* Assignment of value for ELO in the MCAN_IR register */
#define MCAN_IR_EP_Pos                        _UINT32_(23)                                         /* (MCAN_IR) Error Passive Position */
#define MCAN_IR_EP_Msk                        (_UINT32_(0x1) << MCAN_IR_EP_Pos)                    /* (MCAN_IR) Error Passive Mask */
#define MCAN_IR_EP(value)                     (MCAN_IR_EP_Msk & (_UINT32_(value) << MCAN_IR_EP_Pos)) /* Assignment of value for EP in the MCAN_IR register */
#define MCAN_IR_EW_Pos                        _UINT32_(24)                                         /* (MCAN_IR) Warning Status Position */
#define MCAN_IR_EW_Msk                        (_UINT32_(0x1) << MCAN_IR_EW_Pos)                    /* (MCAN_IR) Warning Status Mask */
#define MCAN_IR_EW(value)                     (MCAN_IR_EW_Msk & (_UINT32_(value) << MCAN_IR_EW_Pos)) /* Assignment of value for EW in the MCAN_IR register */
#define MCAN_IR_BO_Pos                        _UINT32_(25)                                         /* (MCAN_IR) Bus_Off Status Position */
#define MCAN_IR_BO_Msk                        (_UINT32_(0x1) << MCAN_IR_BO_Pos)                    /* (MCAN_IR) Bus_Off Status Mask */
#define MCAN_IR_BO(value)                     (MCAN_IR_BO_Msk & (_UINT32_(value) << MCAN_IR_BO_Pos)) /* Assignment of value for BO in the MCAN_IR register */
#define MCAN_IR_WDI_Pos                       _UINT32_(26)                                         /* (MCAN_IR) Watchdog Interrupt Position */
#define MCAN_IR_WDI_Msk                       (_UINT32_(0x1) << MCAN_IR_WDI_Pos)                   /* (MCAN_IR) Watchdog Interrupt Mask */
#define MCAN_IR_WDI(value)                    (MCAN_IR_WDI_Msk & (_UINT32_(value) << MCAN_IR_WDI_Pos)) /* Assignment of value for WDI in the MCAN_IR register */
#define MCAN_IR_PEA_Pos                       _UINT32_(27)                                         /* (MCAN_IR) Protocol Error in Arbitration Phase Position */
#define MCAN_IR_PEA_Msk                       (_UINT32_(0x1) << MCAN_IR_PEA_Pos)                   /* (MCAN_IR) Protocol Error in Arbitration Phase Mask */
#define MCAN_IR_PEA(value)                    (MCAN_IR_PEA_Msk & (_UINT32_(value) << MCAN_IR_PEA_Pos)) /* Assignment of value for PEA in the MCAN_IR register */
#define MCAN_IR_PED_Pos                       _UINT32_(28)                                         /* (MCAN_IR) Protocol Error in Data Phase Position */
#define MCAN_IR_PED_Msk                       (_UINT32_(0x1) << MCAN_IR_PED_Pos)                   /* (MCAN_IR) Protocol Error in Data Phase Mask */
#define MCAN_IR_PED(value)                    (MCAN_IR_PED_Msk & (_UINT32_(value) << MCAN_IR_PED_Pos)) /* Assignment of value for PED in the MCAN_IR register */
#define MCAN_IR_ARA_Pos                       _UINT32_(29)                                         /* (MCAN_IR) Access to Reserved Address Position */
#define MCAN_IR_ARA_Msk                       (_UINT32_(0x1) << MCAN_IR_ARA_Pos)                   /* (MCAN_IR) Access to Reserved Address Mask */
#define MCAN_IR_ARA(value)                    (MCAN_IR_ARA_Msk & (_UINT32_(value) << MCAN_IR_ARA_Pos)) /* Assignment of value for ARA in the MCAN_IR register */
#define MCAN_IR_Msk                           _UINT32_(0x3FCFFFFF)                                 /* (MCAN_IR) Register Mask  */


