MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/mcan.h
/* -------- MCAN_TXBAR : (MCAN Offset: 0xD0) (R/W 32) Transmit Buffer Add Request Register -------- */
#define MCAN_TXBAR_AR0_Pos                    _UINT32_(0)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 0 Position */
#define MCAN_TXBAR_AR0_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR0_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 0 Mask */
#define MCAN_TXBAR_AR0(value)                 (MCAN_TXBAR_AR0_Msk & (_UINT32_(value) << MCAN_TXBAR_AR0_Pos)) /* Assignment of value for AR0 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR1_Pos                    _UINT32_(1)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 1 Position */
#define MCAN_TXBAR_AR1_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR1_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 1 Mask */
#define MCAN_TXBAR_AR1(value)                 (MCAN_TXBAR_AR1_Msk & (_UINT32_(value) << MCAN_TXBAR_AR1_Pos)) /* Assignment of value for AR1 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR2_Pos                    _UINT32_(2)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 2 Position */
#define MCAN_TXBAR_AR2_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR2_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 2 Mask */
#define MCAN_TXBAR_AR2(value)                 (MCAN_TXBAR_AR2_Msk & (_UINT32_(value) << MCAN_TXBAR_AR2_Pos)) /* Assignment of value for AR2 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR3_Pos                    _UINT32_(3)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 3 Position */
#define MCAN_TXBAR_AR3_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR3_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 3 Mask */
#define MCAN_TXBAR_AR3(value)                 (MCAN_TXBAR_AR3_Msk & (_UINT32_(value) << MCAN_TXBAR_AR3_Pos)) /* Assignment of value for AR3 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR4_Pos                    _UINT32_(4)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 4 Position */
#define MCAN_TXBAR_AR4_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR4_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 4 Mask */
#define MCAN_TXBAR_AR4(value)                 (MCAN_TXBAR_AR4_Msk & (_UINT32_(value) << MCAN_TXBAR_AR4_Pos)) /* Assignment of value for AR4 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR5_Pos                    _UINT32_(5)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 5 Position */
#define MCAN_TXBAR_AR5_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR5_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 5 Mask */
#define MCAN_TXBAR_AR5(value)                 (MCAN_TXBAR_AR5_Msk & (_UINT32_(value) << MCAN_TXBAR_AR5_Pos)) /* Assignment of value for AR5 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR6_Pos                    _UINT32_(6)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 6 Position */
#define MCAN_TXBAR_AR6_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR6_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 6 Mask */
#define MCAN_TXBAR_AR6(value)                 (MCAN_TXBAR_AR6_Msk & (_UINT32_(value) << MCAN_TXBAR_AR6_Pos)) /* Assignment of value for AR6 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR7_Pos                    _UINT32_(7)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 7 Position */
#define MCAN_TXBAR_AR7_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR7_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 7 Mask */
#define MCAN_TXBAR_AR7(value)                 (MCAN_TXBAR_AR7_Msk & (_UINT32_(value) << MCAN_TXBAR_AR7_Pos)) /* Assignment of value for AR7 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR8_Pos                    _UINT32_(8)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 8 Position */
#define MCAN_TXBAR_AR8_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR8_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 8 Mask */
#define MCAN_TXBAR_AR8(value)                 (MCAN_TXBAR_AR8_Msk & (_UINT32_(value) << MCAN_TXBAR_AR8_Pos)) /* Assignment of value for AR8 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR9_Pos                    _UINT32_(9)                                          /* (MCAN_TXBAR) Add Request for Transmit Buffer 9 Position */
#define MCAN_TXBAR_AR9_Msk                    (_UINT32_(0x1) << MCAN_TXBAR_AR9_Pos)                /* (MCAN_TXBAR) Add Request for Transmit Buffer 9 Mask */
#define MCAN_TXBAR_AR9(value)                 (MCAN_TXBAR_AR9_Msk & (_UINT32_(value) << MCAN_TXBAR_AR9_Pos)) /* Assignment of value for AR9 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR10_Pos                   _UINT32_(10)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 10 Position */
#define MCAN_TXBAR_AR10_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR10_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 10 Mask */
#define MCAN_TXBAR_AR10(value)                (MCAN_TXBAR_AR10_Msk & (_UINT32_(value) << MCAN_TXBAR_AR10_Pos)) /* Assignment of value for AR10 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR11_Pos                   _UINT32_(11)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 11 Position */
#define MCAN_TXBAR_AR11_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR11_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 11 Mask */
#define MCAN_TXBAR_AR11(value)                (MCAN_TXBAR_AR11_Msk & (_UINT32_(value) << MCAN_TXBAR_AR11_Pos)) /* Assignment of value for AR11 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR12_Pos                   _UINT32_(12)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 12 Position */
#define MCAN_TXBAR_AR12_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR12_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 12 Mask */
#define MCAN_TXBAR_AR12(value)                (MCAN_TXBAR_AR12_Msk & (_UINT32_(value) << MCAN_TXBAR_AR12_Pos)) /* Assignment of value for AR12 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR13_Pos                   _UINT32_(13)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 13 Position */
#define MCAN_TXBAR_AR13_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR13_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 13 Mask */
#define MCAN_TXBAR_AR13(value)                (MCAN_TXBAR_AR13_Msk & (_UINT32_(value) << MCAN_TXBAR_AR13_Pos)) /* Assignment of value for AR13 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR14_Pos                   _UINT32_(14)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 14 Position */
#define MCAN_TXBAR_AR14_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR14_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 14 Mask */
#define MCAN_TXBAR_AR14(value)                (MCAN_TXBAR_AR14_Msk & (_UINT32_(value) << MCAN_TXBAR_AR14_Pos)) /* Assignment of value for AR14 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR15_Pos                   _UINT32_(15)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 15 Position */
#define MCAN_TXBAR_AR15_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR15_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 15 Mask */
#define MCAN_TXBAR_AR15(value)                (MCAN_TXBAR_AR15_Msk & (_UINT32_(value) << MCAN_TXBAR_AR15_Pos)) /* Assignment of value for AR15 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR16_Pos                   _UINT32_(16)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 16 Position */
#define MCAN_TXBAR_AR16_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR16_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 16 Mask */
#define MCAN_TXBAR_AR16(value)                (MCAN_TXBAR_AR16_Msk & (_UINT32_(value) << MCAN_TXBAR_AR16_Pos)) /* Assignment of value for AR16 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR17_Pos                   _UINT32_(17)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 17 Position */
#define MCAN_TXBAR_AR17_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR17_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 17 Mask */
#define MCAN_TXBAR_AR17(value)                (MCAN_TXBAR_AR17_Msk & (_UINT32_(value) << MCAN_TXBAR_AR17_Pos)) /* Assignment of value for AR17 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR18_Pos                   _UINT32_(18)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 18 Position */
#define MCAN_TXBAR_AR18_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR18_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 18 Mask */
#define MCAN_TXBAR_AR18(value)                (MCAN_TXBAR_AR18_Msk & (_UINT32_(value) << MCAN_TXBAR_AR18_Pos)) /* Assignment of value for AR18 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR19_Pos                   _UINT32_(19)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 19 Position */
#define MCAN_TXBAR_AR19_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR19_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 19 Mask */
#define MCAN_TXBAR_AR19(value)                (MCAN_TXBAR_AR19_Msk & (_UINT32_(value) << MCAN_TXBAR_AR19_Pos)) /* Assignment of value for AR19 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR20_Pos                   _UINT32_(20)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 20 Position */
#define MCAN_TXBAR_AR20_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR20_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 20 Mask */
#define MCAN_TXBAR_AR20(value)                (MCAN_TXBAR_AR20_Msk & (_UINT32_(value) << MCAN_TXBAR_AR20_Pos)) /* Assignment of value for AR20 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR21_Pos                   _UINT32_(21)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 21 Position */
#define MCAN_TXBAR_AR21_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR21_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 21 Mask */
#define MCAN_TXBAR_AR21(value)                (MCAN_TXBAR_AR21_Msk & (_UINT32_(value) << MCAN_TXBAR_AR21_Pos)) /* Assignment of value for AR21 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR22_Pos                   _UINT32_(22)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 22 Position */
#define MCAN_TXBAR_AR22_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR22_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 22 Mask */
#define MCAN_TXBAR_AR22(value)                (MCAN_TXBAR_AR22_Msk & (_UINT32_(value) << MCAN_TXBAR_AR22_Pos)) /* Assignment of value for AR22 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR23_Pos                   _UINT32_(23)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 23 Position */
#define MCAN_TXBAR_AR23_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR23_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 23 Mask */
#define MCAN_TXBAR_AR23(value)                (MCAN_TXBAR_AR23_Msk & (_UINT32_(value) << MCAN_TXBAR_AR23_Pos)) /* Assignment of value for AR23 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR24_Pos                   _UINT32_(24)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 24 Position */
#define MCAN_TXBAR_AR24_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR24_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 24 Mask */
#define MCAN_TXBAR_AR24(value)                (MCAN_TXBAR_AR24_Msk & (_UINT32_(value) << MCAN_TXBAR_AR24_Pos)) /* Assignment of value for AR24 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR25_Pos                   _UINT32_(25)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 25 Position */
#define MCAN_TXBAR_AR25_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR25_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 25 Mask */
#define MCAN_TXBAR_AR25(value)                (MCAN_TXBAR_AR25_Msk & (_UINT32_(value) << MCAN_TXBAR_AR25_Pos)) /* Assignment of value for AR25 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR26_Pos                   _UINT32_(26)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 26 Position */
#define MCAN_TXBAR_AR26_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR26_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 26 Mask */
#define MCAN_TXBAR_AR26(value)                (MCAN_TXBAR_AR26_Msk & (_UINT32_(value) << MCAN_TXBAR_AR26_Pos)) /* Assignment of value for AR26 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR27_Pos                   _UINT32_(27)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 27 Position */
#define MCAN_TXBAR_AR27_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR27_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 27 Mask */
#define MCAN_TXBAR_AR27(value)                (MCAN_TXBAR_AR27_Msk & (_UINT32_(value) << MCAN_TXBAR_AR27_Pos)) /* Assignment of value for AR27 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR28_Pos                   _UINT32_(28)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 28 Position */
#define MCAN_TXBAR_AR28_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR28_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 28 Mask */
#define MCAN_TXBAR_AR28(value)                (MCAN_TXBAR_AR28_Msk & (_UINT32_(value) << MCAN_TXBAR_AR28_Pos)) /* Assignment of value for AR28 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR29_Pos                   _UINT32_(29)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 29 Position */
#define MCAN_TXBAR_AR29_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR29_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 29 Mask */
#define MCAN_TXBAR_AR29(value)                (MCAN_TXBAR_AR29_Msk & (_UINT32_(value) << MCAN_TXBAR_AR29_Pos)) /* Assignment of value for AR29 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR30_Pos                   _UINT32_(30)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 30 Position */
#define MCAN_TXBAR_AR30_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR30_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 30 Mask */
#define MCAN_TXBAR_AR30(value)                (MCAN_TXBAR_AR30_Msk & (_UINT32_(value) << MCAN_TXBAR_AR30_Pos)) /* Assignment of value for AR30 in the MCAN_TXBAR register */
#define MCAN_TXBAR_AR31_Pos                   _UINT32_(31)                                         /* (MCAN_TXBAR) Add Request for Transmit Buffer 31 Position */
#define MCAN_TXBAR_AR31_Msk                   (_UINT32_(0x1) << MCAN_TXBAR_AR31_Pos)               /* (MCAN_TXBAR) Add Request for Transmit Buffer 31 Mask */
#define MCAN_TXBAR_AR31(value)                (MCAN_TXBAR_AR31_Msk & (_UINT32_(value) << MCAN_TXBAR_AR31_Pos)) /* Assignment of value for AR31 in the MCAN_TXBAR register */
#define MCAN_TXBAR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (MCAN_TXBAR) Register Mask  */

#define MCAN_TXBAR_AR_Pos                     _UINT32_(0)                                          /* (MCAN_TXBAR Position) Add Request for Transmit Buffer 3x */
#define MCAN_TXBAR_AR_Msk                     (_UINT32_(0xFFFFFFFF) << MCAN_TXBAR_AR_Pos)          /* (MCAN_TXBAR Mask) AR */
#define MCAN_TXBAR_AR(value)                  (MCAN_TXBAR_AR_Msk & (_UINT32_(value) << MCAN_TXBAR_AR_Pos)) 

